import React from 'react';
import {useSelector} from "react-redux";

import css from './homePage.module.css';

const HomePage = () => {
    const {themeStatus} = useSelector(state => state.genre);
    return (

        <div className={themeStatus ? css.homePage : css.homePageLight}>

            {themeStatus &&
                <div className={css.background_container}>
                    <img src="https://s3-us-west-2.amazonaws.com/s.cdpn.io/1231630/moon2.png" alt=""/>
                    <div className={css.stars}></div>
                    <div className={css.twinkling}></div>
                    <div className={css.clouds}></div>

                </div>
            }
            <div className={`${css.textDescribe} ${themeStatus ? css.textDescribeDark : css.textDescribeLight}`}>
                <p>Сьогодні досить складно уявити наше життя без кінематографу. Він охоплює практично все
                    сфери діяльності. Йому трохи більше століття, проте це мистецтво постійно вдосконалюється
                    і змінюється на краще.
                </p>
                <p>
                    На сьогоднішній день знімається така велика кількість фільмів, що майже щодня проходять прем'єри по
                    всьому світу. Однак у стрімкому ритмі сучасного життя не кожен має можливість відвідувати кінотеатри
                    для того, щоб насолодитися переглядом бажаної кінокартини або познайомитися з новинкою, що нещодавно
                    вийшла на великі екрани. У цьому випадку чудовою альтернативою є MovieDB. Сьогодні у нас можна
                    дивитися кращі фільми у високій якості, не виходячи з дому чи офісу, і все це задоволення доступне
                    без реєстрації. Кінотека налічує безліч онлайн фільмів різних жанрів
                </p>
                <p>
                    Представлені у нас картини змусять сумувати або радіти, зазирнути в майбутнє або згадати минуле,
                    занурять Вас у світ фантастики і жахів, що леденять, а також допоможуть дізнатися багато нового і
                    цікавого.
                </p>

                <p>
                    Родзинкою нашого сайту є спеціальний кіношний фільтр, а також сортування у категоріях, призначені
                    для пошуку найкращих фільмів у нашій величезній бібліотеці. Дані модулі дозволяють знайти та
                    відібрати на сайті найкращі картини, що відповідають Вашим вимогам.
                </p>

            </div>

        </div>

    );
};

export {HomePage};